# EA_DataAccCompDel

## Description
Deletes all object components.

```pascal
PROCEDURE EA_DataAccCompDel(acc : INTEGER);
```

```python
def vs.EA_DataAccCompDel(acc):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library